
#include <stdio.h> // ==> 스탠다드(표준)인풋(키보드,마우스)아웃풋(모니터).해더파일
// 1.printf ==> 이름
// 2.()     ==> 소괄호 ==> 함수 ==> 특수한 기능을 정의해논곳.
// 3.;      ==> 세미콜론 ==> 문장이 끝났음을 의미한다.
void main(){
	// LNK1123 :   프로젝트 -> 속성 -> 구성속성 -> 
	// 			   링커 -> 일반 -> 증분링크사용->아니요
	// ctrl + F5  ==> run (실행)(릴리즈모드) ,  //F5(디버그모드)
	// 줄번호  :   도구 -> 옵션 -> 텍스트 편집기 -> C,C++ -> 줄번호 체크
	printf("헬로우 씨언어      ");  // printf(쌍따옴표 ,내용, 쌍따옴표);
	printf("자기소개하기       ");  
	printf("이름 : 홍길동      ");
	printf("나이 : 20살        ");
	printf("사는곳: 신촌 ");
	printf("이메일: !@#!@!@#!@");
	printf("전화번호: 010-1111-2222"); printf("키 : 170cm");
	//문제 1) 이름 , 나이 , 사는곳 , 이메일 , 전화번호 (가짜로) 
	// 주석 >>> 프로그램이 명령을 실행시키지않는 공간 
	// 1. 한줄주석 >>>  // : 슬러쉬 2개 + 내용 ==> 주석뒤에 있는 명령은 무시된다.
	// 2. 여러줄 주석 >>>  /*   내용   */ 
	/*
		ㄴㅇㅁㄴㅇ
		ㅁㄴㅇㅁㄴㅇㅁ
	*/
}

