#include <stdio.h> // printf()
void main(){
	//자기소개
	printf("박병욱 \n 20살 \n 170cm \n 서울신촌\n");
	printf("==============================================\n");
	printf("박병욱 \n %d살 \n %dcm \n 서울신촌\n" , 20 , 170);
	printf("==============================================\n");
	printf("%d + %d = %d\n" , 10 , 20 , 10 + 20);
	printf("==============================================\n");
	//글꼴 ==> consolas ==> 0 O (영 , 오) , L l I i 1 (엘 ,엘 ,아이 ,아이 ,일)
	//서식문자 의 종류 (%d , %lf , %f , %c , %s)
	// 1 . 정수 %d  ==> 소수점이 없는수 : 0 , 1 ,-10 , 100 , -52 ......
	// 2 . 실수 %lf ==> 소수점이 있는수 : 0.1 , 1.4 , -10.45 , 100.0 .....
	// 3 . 실수 %f  ==> 소수점이 있는수 : 0.1 , 1.4 , -10.45 , 100.0 .....
	// 4 . 문자 %c  ==> 한글자(홑따옴표) : 'a' , 'c' , 't' (1byte)// '＠''가'(2byte)
	// 5 . 문자열 %s ==>여러글자(쌍따옴표) : "asdasd" , "가" , "hello" ...
	printf("%s \n %d살 \n %dcm \n %s\n" ,"박병욱" , 20 , 170 , "서울신촌");
	//문제 1) 양쪽 시력 , 강의실이름 출력해보세요. (서식문자사용)
	printf("왼쪽시력 : %lf , 오른쪽시력 : %lf , 강의실 : %c \n" , 0.1 ,0.2 , 'e');
	printf("왼쪽시력 : %.1lf , 오른쪽시력 : %.3lf , 강의실 : %c \n" , 0.1 ,0.2 , 'e');
	printf("왼쪽시력 : %.1lf , 오른쪽시력 : %.10lf , 강의실 : %c \n" , 0.1 ,0.2 , 'e');
}