#include <stdio.h>
// 1. 변수 , 2.연산자 , 3. 조건문  , 4.반복문 , 5.배열 
// 6. 함수 , 7.포인터
void main(){
	//문제 ) 가로가 10 , 세로 가 8 인 사각형 넓이를 구해보세요
	//문제 ) 초를 입력받고 분초로 출력 
	// 예) 입력 : 100  ,  결과 ==> 1분 40초
	//문제 ) 숫자 2개를 저장하고 나누기를 하고 몫과 나머지 출력 

	//화폐매수 , 스왑 , 지하철요금

	//문제 )  숫자하나를 입력받고 양수 인지 음수인지 출력
	//문제 ) 성적을 입력받고 60이상 합격 이하 불합격 출력
	//문제 ) 숫자 하나를 입력받고 양수 음수 짝수 홀수 출력
	//문제 ) 0~20중에서 짝수만 출력
	//문제 ) 0~20중에서 홀수만 다 더한값 출력
	//문제 ) 0~20중 4의 배수만 출력

	// 가위바위보 , 업다운 , atm , 홍콩반점

	int arr[5] = {10,20,300,40,50}
	//문제 ) 인덱스를 입력받고 해당 값을 1000으로 변경
	//문제 ) 값을 입력받으면 해당 인덱스 출력
	//문제 ) 배열안의 가장큰값 작은값 출력 

	// 빙고 , 슬라이드 









}