#include <stdio.h>

void main(){
	//if , for , array 
	//문제 1) 성적하나를 입력받고 60이상이면 합격 
	//문제 2) 숫자 하나를 입력받고 3의 배수 이고 5의 배수인지 확인
	//문제 3) 0~20까지 짝수 출력
	//문제 4) 0~20까지 홀수 합계
	int arr[5] = {0};
	int index = 0;
	//문제 5) 인덱스 하나를 입력받으면 해당요소의 값을 1000으로 저장.
	printf("인덱스를 입력하세요 >>> ");
	scanf("%d" ,index);  // index == 4 
	index = 4;
	arr[0] =0;
	arr[1] =0;
	arr[2] =0;
	arr[3] =0;
	arr[index] = 1000;
	int scores[5] = {10,80,54,60,20};
	int arr[5]; 
	arr[0] =10;
	arr[1] =80;
	arr[2] =54;
	arr[3] =0;
	arr[4] =0;

	//문제 6) 값을 입력받으면 해당 인덱스 출력 
	//점수가 50점 이상인 학생만 출력
}