void  main(){
	// void main {여기} 중괄호 사이에 프로그래밍을 하면된다.
	// ctrl + f5 (실행) ==> 키를 입력받을때까지 기다림 (테스트용)
	// f5 ==> 실행이 되자마자 바로 꺼짐 (정상)

	//주석 : 1. 주석이란 ? 프로그램이 명령을 실행시키지않는공간
	//       2. 주석의 목적 : 1) 설명문   2) 테스트용 
	//       3. 주석의 종류 : 1) 한줄 주석 2) 여러줄 주석 
	//			1) 한줄주석 ==> // + (주석할내용)    (슬러시 2개)  초록색글씨로 바뀐다.
	//			2) 여러줄주석 ==> /* (주석할내용) */  (슬러시 + 별) 2개
	//문제 1) 아래내용을 주석처리 해보세요 
	//문제2) 아래내용을 여러줄 주석 처리 해보세요
	/*
	ㅁㄴㅇㅁㄴㅇㅁㄴㅇ
	ㅁㄴㅇㅁㄴㅇㅁㄴㅇ
	ㅁㄴㅇㅁㄴㅇㅇ
	*/
	//단축키 ==> 드래그후 + 위의 아이콘 클릭 
	//ㅁㄴㅇㅁㄴㅇ
	//	ㅁㄴㅇㅁㄴㅇ
	//	ㅁㄴㅇㅁㄴㅇ
}