#include <stdio.h>
void main(){	
	printf("확인용");printf("\n");
	// printf(확인용); 에러발생("")필요
	printf("10 + 10");printf("\n"); //  10 + 10
	//자료형 ==> 1)문자 , 2)숫자 
	// 문자 표현 ==> "내용"
	// 숫자 표현 ==> "%d", 숫자 
	printf("%d" , 10 + 10); printf("\n");  // 20 
	printf("%d %d" , 10 , 10); printf("\n"); // 10 , 10
	printf("%d %d" , 10 + 1 , 10 + 2 ); printf("\n"); // 11 , 12

	//문제 1) 아래 내용을 출력해보세요  "%d" 사용)
	//  10 + 3 = 13
	printf("%d + %d = %d" , 10, 3 , 10 + 3); printf("\n");
	//  산술연산자 ==> 
	// 문제 2) 산술연산자를 모두 사용해보세요 (10 , 3)
	// 1) 더하기  +
	// 2) 빼기    -
	// 3) 곱하기  *
	// 4) 나누기  /
	// 5) 나머지  %
	printf("%d - %d = %d" , 10, 3 , 10 - 3); printf("\n");
	printf("%d %% %d = %d" , 10, 3 , 10 % 3); printf("\n"); // % 를표현할때는 %% 두개사용
}