#include <stdio.h>
/*
	변수 ==> 자료를 저장하는 공간
	자료형 ==> int ==> 정수 (4byte)
	          float ==> 실수 (4byte); 공간이 적어 정확하지 않다
	          double ==> 실수 (8byte)
			  char ==> 문자 (1byte); 알파벳만 가능 (한글, 특수문자 2byte)
			  char[20] ==> 문자열 (20byte); 여러글자

	변수의 특징 :
		1. 변수선언은 어떤 식보다 위에 있어야한다. (중간에 선언 불가능)
		2. 변수는 하나의 값만 저장가능하다. ==> 새로운 값이 들어오면 전의 값은 사라진다
	
	변수의 이름 규칙 :
		1. 숫자로 시작할 수 없다. (첫글자만 아니면 ok)
		2. 특수기호는 _ (언더바) 는 가능하다. 
		3. 대소문자를 구분한다. 
		4. 변수명은 보통 소문자로 시작한다. 
		5. 두단어가 변수명으로 사용될 때는 보통 2가지 방법으로 표현한다.
				a) 카멜식
				- 2번째 단어 첫글자를 대문자로 표기 (낙타등모양)
				- 예 ) korScore
				b) 스네이크식
				- 2번째 단어 첫글자 앞에 _ 를 붙인다 (뱀모양)
				- 예 ) kor_score
*/

void main() {



}